//対象部位
var spList = [
/*トマト*/
	["葉（表）","葉（裏）","花","果実","茎","茎頂部","地際部","根部","全体"],
/*イチゴ*/
	["葉（表）","葉（裏）","葉柄","花","果実","果柄","ランナー","茎頂部","クラウン","全体"],
/*キュウリ*/
	["葉（表）","葉（裏）","花","果実","つる","茎","茎頂部","地際部","全体"],
/*ナス*/
	["葉（表）","葉（裏）","花","果実","茎","茎頂部","茎断面","地際部","全体"]
];


//病害
var pdnList1 = [
/*トマト*/
	["葉かび病","灰色かび病","うどんこ病","青枯病","すすかび病","褐色輪紋病","黄化葉巻病","褐色根腐病","かいよう病","モザイク病（ToMV)","疫病"],
/*イチゴ*/
	["灰色かび病","うどんこ病","輪斑病","疫病","炭疽病（萎凋症）","炭疽病（葉枯症）","萎黄病"],
/*キュウリ*/	
	["灰色かび病","うどんこ病","疫病","炭疽病","CCYV","CMV","KGMMV","MYSV","ＷＭＶ","ZYMV","べと病","褐斑病","つる枯病","菌核病","黒星病","斑点細菌病"],
/*ナス*/
	["灰色かび病","うどんこ病","青枯病","すすかび病","輪紋病","黒点根腐病","根腐疫病","褐斑病","褐斑細菌病","菌核病","褐色斑点病","褐色腐敗病","褐色円星病","褐紋病","茎えそ細菌病","茎腐細菌病","黒枯病","苗立枯病","半枯病","半身萎凋病"]
];

//虫害
var pdnList2 = [
/*トマト*/
	["ワタアブラムシ","モモアカアブラムシ","チューリップヒゲナガアブラムシ","ジャガイモヒゲナガアブラムシ","ヒラズハナアザミウマ","ミカンキイロアザミウマ","ネギアザミウマ","タバココナジラミ","オンシツコナジラミ","トマトハモグリバエ","マメハモグリバエ","ナミハダニ","カンザワハダニ","オオタバコガ","ハスモンヨトウ","トマトサビダニ","ネコブセンチュウ","すす病（アブラムシ類）","すす病（コナジラミ類）"],
/*イチゴ*/
	["ワタアブラムシ","ヒラズハナアザミウマ","ミカンキイロアザミウマ","ネギアザミウマ","チャノキイロアザミウマ","タバココナジラミ","オンシツコナジラミ","ナミハダニ","カンザワハダニ","ハスモンヨトウ","チャノホコリダニ","すす病（アブラムシ類）","すす病（コナジラミ類）"],
/*キュウリ*/
	["ワタアブラムシ","モモアカアブラムシ","チューリップヒゲナガアブラムシ","ジャガイモヒゲナガアブラムシ","ミナミキイロアザミウマ","ヒラズハナアザミウマ","ミカンキイロアザミウマ","ネギアザミウマ","タバココナジラミ","オンシツコナジラミ","トマトハモグリバエ","ナミハダニ","カンザワハダニ","オオタバコガ","ハスモンヨトウ","トマトサビダニ","ネコブセンチュウ","チャノホコリダニ","ワタヘリクロノメイガ","ウリキンウワバ","ウリハムシ","ヨトウガ","ニジュウヤホシテントウ","ノハラナメクジ","すす病（アブラムシ類）","すす病（コナジラミ類）"],
/*ナス*/
	["ワタアブラムシ","モモアカアブラムシ","チューリップヒゲナガアブラムシ","ジャガイモヒゲナガアブラムシ","ミナミキイロアザミウマ","ヒラズハナアザミウマ","ミカンキイロアザミウマ","ネギアザミウマ","タバココナジラミ","オンシツコナジラミ","トマトハモグリバエ","マメハモグリバエ","ナスハモグリバエ","ナミハダニ","カンザワハダニ","オオタバコガ","ハスモンヨトウ","ネコブセンチュウ","チャノホコリダニ","アズキノメイガ　","タバコノミハムシ","ナスノミハムシ","カスミカメムシ類","ウスカワマイマイ","カブラヤガ","アオクサカメムシ","ミナミアオカメムシ","メンガタスズメ","ヨトウガ","マメコガネ","オオニジュウヤホシテントウ","ニジュウヤホシテントウ","チャコウラナメクジ","すす病（アブラムシ類）","すす病（コナジラミ類）"]
];


//********************************************************//


//対象作物名
var cropList = [
	{"value":1,"name":"トマト"},
	{"value":2,"name":"イチゴ"},
	{"value":3,"name":"キュウリ"},
	{"value":4,"name":"ナス"},
];

/*
//試験機関
var orgList =[
	["岩手","茨城","新潟","岐阜","広島","熊本"],
	["宮城","栃木","静岡","兵庫","香川","長崎"],
	["福島","埼玉","長野","愛知","高知","宮崎"],
	["群馬","富山","山梨","三重","京都","鹿児島"]
];
*/

//試験機関
orgList =[
	[{"value":03,"name":"岩手"},{"value":08,"name":"茨城"},{"value":15,"name":"新潟"},{"value":21,"name":"岐阜"},{"value":34,"name":"広島"},{"value":43,"name":"熊本"},{"value":52,"name":"農研機構野菜花き"}],
	[{"value":04,"name":"宮城"},{"value":09,"name":"栃木"},{"value":22,"name":"静岡"},{"value":28,"name":"兵庫"},{"value":37,"name":"香川"},{"value":42,"name":"長崎"},{"value":52,"name":"農研機構野菜花き"}],
	[{"value":07,"name":"福島"},{"value":11,"name":"埼玉"},{"value":20,"name":"長野"},{"value":23,"name":"愛知"},{"value":39,"name":"高知"},{"value":45,"name":"宮崎"},{"value":51,"name":"農研機構中央"}],
	[{"value":10,"name":"群馬"},{"value":16,"name":"富山"},{"value":19,"name":"山梨"},{"value":24,"name":"三重"},{"value":26,"name":"京都"},{"value":46,"name":"鹿児島"},{"value":51,"name":"農研機構中央"}]
];

//環境
var envList = [
		{"value":1,"name":"露地"},
		{"value":2,"name":"施設"},
		{"value":3,"name":"グロースチャンバー"}
];


//病害虫区分
var pdcList = [

	{"value":0,"name":"健全"},
	{"value":1,"name":"病害"},
	{"value":2,"name":"虫害"},
	{"value":3,"name":"該当なし"}

]


//同定区分
var pdiList = [
		{"value":1,"name":"専門家による同定"},
		{"value":2,"name":"簡易的な判定"},
		{"value":3,"name":"該当無し"}
];


//虫体区分
var pbcList = [
	{"value":1,"name":"個体"},
	{"value":2,"name":"群体"}
];


